CSI API ETABS v1

# cAnalysisResultsSetupSetOptionModalHist Method

---

Sets the output option for modal history results.

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int SetOptionModalHist(
    	int Value
    )

    Function SetOptionModalHist (
    	Value As Integer
    ) As Integer

    Dim instance As cAnalysisResultsSetup
    Dim Value As Integer
    Dim returnValue As Integer

    returnValue = instance.SetOptionModalHist(Value)

    int SetOptionModalHist(
    	int Value
    )

    abstract SetOptionModalHist :
            Value : int -> int

#### Parameters

Value

    Type: SystemInt32
This item is 1, 2 or 3

  1. Envelopes
  2. Step-by-Step
  3. Last Step

#### Return Value

Type: Int32
Returns 0 if the output option is successfully set, otherwise it returns
nonzero.

Remarks

See Also

#### Reference

cAnalysisResultsSetup Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com